{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "23"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "9"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/q_network_pi_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/asteroid_encoder_1/fc1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/asteroid_encoder_1/fc1_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/asteroid_encoder_1/fc2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/asteroid_encoder_1/fc2_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/Reshape_2/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/fc1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "66"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/fc1_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/fc2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/fc2_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/fc3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/fc3_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "23"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/strided_slice_1", "op": "StridedSlice", "input": ["inputs", "StatefulPartitionedCall/q_network_pi_1/strided_slice_1/stack", "StatefulPartitionedCall/q_network_pi_1/strided_slice_1/stack_1", "StatefulPartitionedCall/q_network_pi_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/strided_slice_2", "op": "StridedSlice", "input": ["inputs", "StatefulPartitionedCall/q_network_pi_1/strided_slice_2/stack", "StatefulPartitionedCall/q_network_pi_1/strided_slice_2/stack_1", "StatefulPartitionedCall/q_network_pi_1/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/q_network_pi_1/strided_slice_2", "StatefulPartitionedCall/q_network_pi_1/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/asteroid_encoder_1/fc1_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/q_network_pi_1/Reshape_1", "StatefulPartitionedCall/q_network_pi_1/asteroid_encoder_1/fc1_1/Cast/ReadVariableOp", "StatefulPartitionedCall/q_network_pi_1/asteroid_encoder_1/fc1_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/asteroid_encoder_1/fc2_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/q_network_pi_1/asteroid_encoder_1/fc1_1/Relu", "StatefulPartitionedCall/q_network_pi_1/asteroid_encoder_1/fc2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/q_network_pi_1/asteroid_encoder_1/fc2_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/q_network_pi_1/asteroid_encoder_1/fc2_1/Relu", "StatefulPartitionedCall/q_network_pi_1/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/Max", "op": "Max", "input": ["StatefulPartitionedCall/q_network_pi_1/Reshape_2", "StatefulPartitionedCall/q_network_pi_1/Max/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/q_network_pi_1/strided_slice_1", "StatefulPartitionedCall/q_network_pi_1/Max", "StatefulPartitionedCall/q_network_pi_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/fc1_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/q_network_pi_1/concat", "StatefulPartitionedCall/q_network_pi_1/fc1_1/Cast/ReadVariableOp", "StatefulPartitionedCall/q_network_pi_1/fc1_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/fc2_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/q_network_pi_1/fc1_1/Relu", "StatefulPartitionedCall/q_network_pi_1/fc2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/q_network_pi_1/fc2_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/q_network_pi_1/fc3_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/q_network_pi_1/fc2_1/Relu", "StatefulPartitionedCall/q_network_pi_1/fc3_1/Cast/ReadVariableOp", "StatefulPartitionedCall/q_network_pi_1/fc3_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/q_network_pi_1/fc3_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/q_network_pi_1/strided_slice_1/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/strided_slice_1/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/strided_slice_1/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/strided_slice_2/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/strided_slice_2/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/strided_slice_2/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/Reshape_1/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/asteroid_encoder_1/fc1_1/Cast/ReadVariableOp", "shape": [3, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/asteroid_encoder_1/fc1_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/asteroid_encoder_1/fc2_1/Cast/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/asteroid_encoder_1/fc2_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/Reshape_2/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/Max/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/fc1_1/Cast/ReadVariableOp", "shape": [66, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/fc1_1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/fc2_1/Cast/ReadVariableOp", "shape": [256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/fc2_1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/fc3_1/Cast/ReadVariableOp", "shape": [256, 9], "dtype": "float32"}, {"name": "StatefulPartitionedCall/q_network_pi_1/fc3_1/BiasAdd/ReadVariableOp", "shape": [9], "dtype": "float32"}]}]}